name: "StreetNet"
layer {
	name: "window_data"
	top:  "data"
	top:  "az_cls_label"
	top:  "az_reg_label_0"
	top:  "az_reg_label_1"
	top:  "el_cls_label"
	top:  "el_reg_label_0"
	top:  "el_reg_label_1"
	type: "Python"
	python_param {
		module: "python_layers.pascal_window_data"
		layer: "PythonPascalWindowLayer"
		param_str: "--window_file /work4/pulkitag-code/code/projStreetView/pose-files/euler_train_pascal3d_imSz256_pdSz36.txt --im_root_folder /data0/pulkitag/data_sets/pascal_3d/imCrop/imSz256_pad36"
	}
}

