name: "StreetNet"
layer {
	name: "window_data"
	top:  "data"
	top:  "label"
	type: "Python"
	python_param {
		module: "python_layers.nrml_nyu_window_data"
		layer: "NrmlWindowLayerCls"
		param_str: "--jitter 24 --split test --batch_size 5"
	}
}

