layer {
  name: "slice_label"
  type: "Slice"
  bottom: "pair_label"
  top: "nrml_label"
  top: "ptch_label"
  slice_param {
    slice_dim: 1
    slice_point: 6
  }
}
layer {
  name: "slice_nrml_label"
  type: "Slice"
  bottom: "nrml_label"
  top: "nrml_1_label"
  top: "nrml_2_label"
  slice_param {
    slice_dim: 1
    slice_point: 3
  }
}

