layer {
  name: "slice_pair"
  type: "Slice"
  bottom: "pair_data"
  top: "data"
  top: "data_p"
  slice_param {
    slice_dim: 1
    slice_point: 3
  }
}
layer {
  name: "slice_label"
  type: "Slice"
  bottom: "pair_label"
  top: "pose_label"
  top: "ptch_label"
  slice_param {
    slice_dim: 1
    slice_point: 5
  }
}
